
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 9 to add, 0 to change, 9 to destroy.</code></pre>

* Create
  * module.postgresql[0].azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql[0].azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.postgresql[0].azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.postgresql[0].azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;azure.extensions&#34;]
  * module.postgresql[0].azurerm_postgresql_flexible_server_database.pg_databases[&#34;subscriptionmanagement&#34;]
  * module.postgresql[0].azurerm_resource_group.rg[0]
  * module.postgresql[0].null_resource.set-user-permissions-additionaldbs[&#34;subscriptionmanagement&#34;]
  * module.postgresql[0].random_password.password
  * module.postgresql[0].terraform_data.trigger_password_reset
* Delete
  * module.postgresql.azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.postgresql.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;azure.extensions&#34;]
  * module.postgresql.azurerm_postgresql_flexible_server_database.pg_databases[&#34;subscriptionmanagement&#34;]
  * module.postgresql.azurerm_resource_group.rg[0]
  * module.postgresql.null_resource.set-user-permissions-additionaldbs[&#34;subscriptionmanagement&#34;]
  * module.postgresql.random_password.password
  * module.postgresql.terraform_data.trigger_password_reset


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.postgresql.azurerm_postgresql_flexible_server.pgsql_server will be destroyed
  # (because module.postgresql is not in configuration)
  - resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      - administrator_login               = "subscriptionmanagement_user" -> null
      - administrator_password            = (sensitive value) -> null
      - administrator_password_wo         = (write-only attribute) -> null
      - administrator_password_wo_version = 0 -> null
      - auto_grow_enabled                 = false -> null
      - backup_retention_days             = 35 -> null
      - create_mode                       = "Default" -> null
      - delegated_subnet_id               = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/virtualNetworks/ss-prod-vnet/subnets/postgresql" -> null
      - fqdn                              = "flexible-pip-subscription-management-prod.postgres.database.azure.com" -> null
      - geo_redundant_backup_enabled      = false -> null
      - id                                = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/flexible-pip-subscription-management-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/flexible-pip-subscription-management-prod" -> null
      - location                          = "uksouth" -> null
      - name                              = "flexible-pip-subscription-management-prod" -> null
      - private_dns_zone_id               = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/private.postgres.database.azure.com" -> null
      - public_network_access_enabled     = false -> null
      - resource_group_name               = "flexible-pip-subscription-management-data-prod" -> null
      - sku_name                          = "GP_Standard_D2s_v3" -> null
      - storage_mb                        = 65536 -> null
      - storage_tier                      = "P6" -> null
      - tags                              = {
          - "application"         = "publishing-information-service"
          - "builtFrom"           = "https://github.com/HMCTS/pip-subscription-management.git"
          - "businessArea"        = "Cross-Cutting"
          - "contactSlackChannel" = "#publishing-and-information"
          - "environment"         = "production"
          - "managedBy"           = "Future Hearings - Publishing Information Project"
        } -> null
      - version                           = "15" -> null
      - zone                              = "2" -> null
        # (1 unchanged attribute hidden)

      - authentication {
          - active_directory_auth_enabled = true -> null
          - password_auth_enabled         = true -> null
          - tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        }

      - high_availability {
          - mode                      = "ZoneRedundant" -> null
          - standby_availability_zone = "1" -> null
        }

      - maintenance_window {
          - day_of_week  = 0 -> null
          - start_hour   = 3 -> null
          - start_minute = 0 -> null
        }
    }

  # module.postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be destroyed
  # (because module.postgresql is not in configuration)
  - resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      - id                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/flexible-pip-subscription-management-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/flexible-pip-subscription-management-prod/administrators/4d0554dd-fe60-424a-be9c-36636826d927" -> null
      - object_id           = "4d0554dd-fe60-424a-be9c-36636826d927" -> null
      - principal_name      = "DTS Platform Operations SC" -> null
      - principal_type      = "Group" -> null
      - resource_group_name = "flexible-pip-subscription-management-data-prod" -> null
      - server_name         = "flexible-pip-subscription-management-prod" -> null
      - tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # module.postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0] will be destroyed
  # (because module.postgresql is not in configuration)
  - resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_principal_admin" {
      - id                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/flexible-pip-subscription-management-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/flexible-pip-subscription-management-prod/administrators/7ef3b6ce-3974-41ab-8512-c3ef4bb8ae01" -> null
      - object_id           = "7ef3b6ce-3974-41ab-8512-c3ef4bb8ae01" -> null
      - principal_name      = "jenkins-ptl-mi" -> null
      - principal_type      = "ServicePrincipal" -> null
      - resource_group_name = "flexible-pip-subscription-management-data-prod" -> null
      - server_name         = "flexible-pip-subscription-management-prod" -> null
      - tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # module.postgresql.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["azure.extensions"] will be destroyed
  # (because module.postgresql is not in configuration)
  - resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      - id        = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/flexible-pip-subscription-management-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/flexible-pip-subscription-management-prod/configurations/azure.extensions" -> null
      - name      = "azure.extensions" -> null
      - server_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/flexible-pip-subscription-management-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/flexible-pip-subscription-management-prod" -> null
      - value     = "plpgsql, pg_stat_statements, pg_buffercache" -> null
    }

  # module.postgresql.azurerm_postgresql_flexible_server_database.pg_databases["subscriptionmanagement"] will be destroyed
  # (because module.postgresql is not in configuration)
  - resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      - charset   = "UTF8" -> null
      - collation = "en_GB.utf8" -> null
      - id        = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/flexible-pip-subscription-management-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/flexible-pip-subscription-management-prod/databases/subscriptionmanagement" -> null
      - name      = "subscriptionmanagement" -> null
      - server_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/flexible-pip-subscription-management-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/flexible-pip-subscription-management-prod" -> null
    }

  # module.postgresql.azurerm_resource_group.rg[0] will be destroyed
  # (because module.postgresql is not in configuration)
  - resource "azurerm_resource_group" "rg" {
      - id         = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/flexible-pip-subscription-management-data-prod" -> null
      - location   = "uksouth" -> null
      - name       = "flexible-pip-subscription-management-data-prod" -> null
      - tags       = {
          - "application"         = "publishing-information-service"
          - "builtFrom"           = "https://github.com/HMCTS/pip-subscription-management.git"
          - "businessArea"        = "Cross-Cutting"
          - "contactSlackChannel" = "#publishing-and-information"
          - "environment"         = "production"
          - "managedBy"           = "Future Hearings - Publishing Information Project"
        } -> null
        # (1 unchanged attribute hidden)
    }

  # module.postgresql.null_resource.set-user-permissions-additionaldbs["subscriptionmanagement"] will be destroyed
  # (because module.postgresql is not in configuration)
  - resource "null_resource" "set-user-permissions-additionaldbs" {
      - id       = "8254014557689652733" -> null
      - triggers = {
          - "db_reader_user" = "DTS JIT Access pip DB Reader SC"
          - "force_trigger"  = "2"
          - "name"           = "flexible-pip-subscription-management"
          - "script_hash"    = "dbe0102f3129d4463913d5e01177e806bc6954005bdd98f20c242658634a1bbc"
        } -> null
    }

  # module.postgresql.random_password.password will be destroyed
  # (because module.postgresql is not in configuration)
  - resource "random_password" "password" {
      - bcrypt_hash      = (sensitive value) -> null
      - id               = "none" -> null
      - length           = 20 -> null
      - lower            = true -> null
      - min_lower        = 0 -> null
      - min_numeric      = 0 -> null
      - min_special      = 0 -> null
      - min_upper        = 0 -> null
      - number           = true -> null
      - numeric          = true -> null
      - override_special = "()-_" -> null
      - result           = (sensitive value) -> null
      - special          = true -> null
      - upper            = true -> null
    }

  # module.postgresql.terraform_data.trigger_password_reset will be destroyed
  # (because module.postgresql is not in configuration)
  - resource "terraform_data" "trigger_password_reset" {
      - id     = "f3c9ef1f-9ccb-5689-d6d3-77ad499bd014" -> null
      - input  = "" -> null
      - output = "" -> null
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server.pgsql_server will be created
  + resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      + administrator_login           = "subscriptionmanagement_user"
      + administrator_password        = (sensitive value)
      + administrator_password_wo     = (write-only attribute)
      + auto_grow_enabled             = false
      + backup_retention_days         = 35
      + create_mode                   = "Default"
      + delegated_subnet_id           = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/virtualNetworks/ss-prod-vnet/subnets/postgresql"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "flexible-pip-subscription-management-prod"
      + private_dns_zone_id           = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/private.postgres.database.azure.com"
      + public_network_access_enabled = false
      + resource_group_name           = "flexible-pip-subscription-management-data-prod"
      + sku_name                      = "GP_Standard_D2s_v3"
      + storage_mb                    = 65536
      + storage_tier                  = (known after apply)
      + tags                          = {
          + "application"         = "publishing-information-service"
          + "builtFrom"           = "https://github.com/HMCTS/pip-subscription-management.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#publishing-and-information"
          + "environment"         = "production"
          + "managedBy"           = "Future Hearings - Publishing Information Project"
        }
      + version                       = "15"

      + authentication {
          + active_directory_auth_enabled = true
          + password_auth_enabled         = true
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
        }

      + high_availability {
          + mode = "ZoneRedundant"
        }

      + maintenance_window {
          + day_of_week  = 0
          + start_hour   = 3
          + start_minute = 0
        }
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      + id                  = (known after apply)
      + object_id           = "4d0554dd-fe60-424a-be9c-36636826d927"
      + principal_name      = "DTS Platform Operations SC"
      + principal_type      = "Group"
      + resource_group_name = "flexible-pip-subscription-management-data-prod"
      + server_name         = "flexible-pip-subscription-management-prod"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0] will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_principal_admin" {
      + id                  = (known after apply)
      + object_id           = "7ef3b6ce-3974-41ab-8512-c3ef4bb8ae01"
      + principal_name      = "jenkins-ptl-mi"
      + principal_type      = "ServicePrincipal"
      + resource_group_name = "flexible-pip-subscription-management-data-prod"
      + server_name         = "flexible-pip-subscription-management-prod"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_configuration.pgsql_server_config["azure.extensions"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "azure.extensions"
      + server_id = (known after apply)
      + value     = "plpgsql, pg_stat_statements, pg_buffercache"
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_database.pg_databases["subscriptionmanagement"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      + charset   = "utf8"
      + collation = "en_GB.utf8"
      + id        = (known after apply)
      + name      = "subscriptionmanagement"
      + server_id = (known after apply)
    }

  # module.postgresql[0].azurerm_resource_group.rg[0] will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "flexible-pip-subscription-management-data-prod"
      + tags     = {
          + "application"         = "publishing-information-service"
          + "builtFrom"           = "https://github.com/HMCTS/pip-subscription-management.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#publishing-and-information"
          + "environment"         = "production"
          + "managedBy"           = "Future Hearings - Publishing Information Project"
        }
    }

  # module.postgresql[0].null_resource.set-user-permissions-additionaldbs["subscriptionmanagement"] will be created
  + resource "null_resource" "set-user-permissions-additionaldbs" {
      + id       = (known after apply)
      + triggers = {
          + "db_reader_user" = "DTS JIT Access pip DB Reader SC"
          + "force_trigger"  = "2"
          + "name"           = "flexible-pip-subscription-management"
          + "script_hash"    = "dbe0102f3129d4463913d5e01177e806bc6954005bdd98f20c242658634a1bbc"
        }
    }

  # module.postgresql[0].random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 20
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "()-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.postgresql[0].terraform_data.trigger_password_reset will be created
  + resource "terraform_data" "trigger_password_reset" {
      + id     = (known after apply)
      + input  = ""
      + output = (known after apply)
    }

Plan: 9 to add, 0 to change, 9 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":428,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->